robinhedwards/UnoCart-2600/source/STM32firmware/FirmwareUpdater/src/main.c
/*
******************************************************************************
File:     main.cpp
Info:     Generated by Atollic TrueSTUDIO(R) 9.0.1   2018-06-20

The MIT License (MIT)
Copyright (c) 2018 STMicroelectronics

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

******************************************************************************
*/

/* Includes */
#include "stm32f4xx.h"

#include "ace2600.h"
#include "flash.h"

/* Private macro */
/* Private variables */
/* Private function prototypes */
/* Private functions */

extern void Reset_Handler();

extern void __file_size;
extern void _binary_Debug_AtariCart_bin_end;
extern void _binary_Debug_AtariCart_bin_size;
extern void _binary_Debug_AtariCart_bin_start;

extern ACEFileHeader AceHeader;

ACEFileHeader AceHeader __attribute__ ((section (".file_header"))) __attribute__ ((__used__)) =
{
	.magic_number = "ACE-2600",
	.driver_name = "Firmware Updater",
	.driver_version = 1,
	.rom_size = &__file_size,
	.rom_checksum = 0,
	.entry_point = (uint32_t)Reset_Handler
};


/**
**===========================================================================
**
**  Abstract: main program
**
**===========================================================================
*/
int main(void)
{
	__disable_irq(); // Good idea?
    flash_context ctx;

    if (!prepare_flash(&_binary_Debug_AtariCart_bin_size, &ctx))
    	{
    		return false;
    	}

    if (!write_flash(&_binary_Debug_AtariCart_bin_size, (uint8_t *)&_binary_Debug_AtariCart_bin_start, &ctx))
    {
    	return false;
    }

    while(1);
}
